robegamesios/FFT_ESP32_Analyzer/src/main.cpp
#include <ESP32-VirtualMatrixPanel-I2S-DMA.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>

/********************************************************************************************************************************************************
 * EPS32 Audio Visualizer 
 * Github: https://github.com/robegamesios/FFT_ESP32_Analyzer
 * Features:
 *  Web interface by accessing the ESP32 wifi address
 *  Update the firmware via OTA
 * 
 * Forked from https://github.com/donnersm/FFT_ESP32_Analyzer
 
********************************************************************************************************************************************************/


// Wifi Manager and OTA update
#include <WiFiManager.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <Update.h>

const char *host = "esp32";
WiFiManager wm;
WebServer server(80);

/* Style */
String style =
    "<style>#file-input,input{width:100%;height:44px;border-radius:4px;margin:10px auto;font-size:15px}"
    "input{background:#f1f1f1;border:0;padding:0 15px}body{background:#3498db;font-family:sans-serif;font-size:14px;color:#777}"
    "#file-input{padding:0;border:1px solid #ddd;line-height:44px;text-align:left;display:block;cursor:pointer}"
    "#bar,#prgbar{background-color:#f1f1f1;border-radius:10px}#bar{background-color:#3498db;width:0%;height:10px}"
    "form{background:#fff;max-width:258px;margin:75px auto;padding:30px;border-radius:5px;text-align:center}"
    ".btn{background:#3498db;color:#fff;cursor:pointer}</style>";

/* Server Index Page */
String serverIndex =
    "<script src='https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js'></script>"

    "<form name=selectPattern>"
    "<h2>Select Visualizer Pattern</h2>"
    "<p>This will change the visualizer pattern.</p>"
    "<select name='option'>"
    "<option value='12' title='Auto Change every 1 Min'>Auto Change every 1 Min</option>"
    "<option value='0' title='Boxed Bars'>Boxed Bars</option>"
    "<option value='1' title='Boxed Bars 2'>Boxed Bars 2</option>"
    "<option value='2' title='Boxed Bars 3'>Boxed Bars 3</option>"
    "<option value='3' title='Red Bars'>Red Bars</option>"
    "<option value='4' title='Color Bars'>Color Bars</option>"
    "<option value='5' title='=Twins'>Twins</option>"
    "<option value='6' title='Twins 2'>Twins 2</option>"
    "<option value='7' title='Tri Bars'>Tri Bars</option>"
    "<option value='8' title='Tri Bars 2'>Tri Bars 2</option>"
    "<option value='9' title='Center Bars'>Center Bars</option>"
    "<option value='10' title='Center Bars 2'>Center Bars 2</option>"
    "<option value='11' title='Black Bars'>Black Bars</option>"
    "</select><br><br>"
    "<input onclick=updateVisualizer() class=btn value='Update Pattern'></form>"

    "<form method='POST' action='#' enctype='multipart/form-data' id='upload_form'>"
    "<h2>Update Firmware</h2>"
    "<p>Change to a different theme.</p>"
    "<input type='file' name='update' id='file' onchange='sub(this)' style=display:none>"
    "<label id='file-input' for='file'>   Choose file...</label>"
    "<input type='submit' class=btn value='Update Firmware'>"
    "<br><br>"
    "<div id='prg'></div>"
    "<br><div id='prgbar'><div id='bar'></div></div><br></form>"

    "<form name=resetForm>"
    "<h2>Reset WiFi</h2>"
    "<p>This will reset the WiFi configuration.</p>"
    "<input onclick=resetWiFi() class=btn value='Reset WiFi'></form>"

    "<script>"
    "function updateVisualizer() {"
    "var selectedPatternTitle = document.forms['selectPattern']['option'].selectedOptions[0].getAttribute('title');"
    "var selectedPatternValue = document.forms['selectPattern']['option'].value;"
    "var xhr = new XMLHttpRequest();"
    "xhr.open('GET', '/update_visualizer?pattern=' + encodeURIComponent(selectedPatternValue), true);"
    "xhr.onreadystatechange = function () {"
    "if (xhr.readyState === 4 && xhr.status === 200) {"
    "alert('Selected Visualizer Pattern updated to: ' + selectedPatternTitle);"
    "}"
    "};"
    "xhr.send();"
    "}"

    "function resetWiFi() {"
    "if (confirm('Are you sure you want to reset the WiFi? This will clear WiFi configuration.')) {"
    "window.location.href = '/reset_wifi';"
    "}"
    "}"

    "function sub(obj){"
    "var fileName = obj.value.split('\\\\');"
    "document.getElementById('file-input').innerHTML = '   '+ fileName[fileName.length-1];"
    "};"

    "$('form').submit(function(e){"
    "e.preventDefault();"
    "var form = $('#upload_form')[0];"
    "var data = new FormData(form);"
    "$.ajax({"
    "url: '/update_firmware',"
    "type: 'POST',"
    "data: data,"
    "contentType: false,"
    "processData: false,"
    "xhr: function() {"
    "var xhr = new window.XMLHttpRequest();"
    "xhr.upload.addEventListener('progress', function(evt) {"
    "if (evt.lengthComputable) {"
    "var per = evt.loaded / evt.total;"
    "$('#prg').html('progress: ' + Math.round(per*100) + '%');"
    "$('#bar').css('width',Math.round(per*100) + '%');"
    "}"
    "}, false);"
    "return xhr;"
    "},"
    "success:function(d, s) {"
    "console.log('success!') "
    "},"
    "error: function (a, b, c) {"
    "}"
    "});"
    "});"
    "</script>" +
    style;

#include <FastLED_NeoMatrix.h>
#include <arduinoFFT.h>
#include "I2SPLUGIN.h"
#include <math.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include "FFT.h"
#include "LEDDRIVER.H"
#include "Settings.h"
#include "PatternsHUB75.h"
#include "PatternsLedstrip.h"
#include "fire.h"

int skip = true;
int ButtonOnTimer = 0;
int ButtonStarttime = 0;
int ButtonSequenceCounter = 0;
int ButtonOffTimer = 0;
int ButtonStoptime = 0;

int ButtonPressedCounter = 0;
int ButtonReleasedCounter = 0;
int ShortPressFlag = 0;
int LongPressFlag = 0;
int LongerPressFlag = 0;
boolean Next_is_new_pressed = true;
boolean Next_is_new_release = true;
int PreviousPressTime = 0;
#define up 1
#define down 0
int PeakDirection = 0;

long LastDoNothingTime = 0; // only needed for screensaver
int DemoModeMem = 0;        // to remember what mode we are in when going to demo, in order to restore it after wake up
bool AutoModeMem = false;   // same story
bool DemoFlag = false;      // we need to know if demo mode was manually selected or auto engadged.

char LCDPrintBuf[30];

// Function to update visualizer settings
void updateVisualizerSettings(int pattern)
{
  if (pattern == 12)
  {
    autoChangePatterns = true;
  }
  else
  {
    autoChangePatterns = false;
    buttonPushCounter = pattern;
  }
}

