robegamesios/FFT_ESP32_Analyzer/src/main.cpp
  // Process the FFT data into bar heights
  for (int band = 0; band < numBands; band++)
  {
    int barHeight = FreqBins[band] * kMatrixHeight - 1; //(AMPLITUDE);
    if (barHeight > TOP - 2)
      barHeight = TOP - 2;

    // Small amount of averaging between frames
    barHeight = ((oldBarHeights[band] * 1) + barHeight) / 2;

    // Move peak up
    if (barHeight > peak[band])
    {
      peak[band] = min(TOP, barHeight);
      PeakFlag[band] = 1;
    }
    bndcounter[band] += barHeight; // ten behoeve calibratie

    // if there hasn't been much of a input signal for a longer time ( see settings ) go to demo mode
    if ((millis() - LastDoNothingTime) > DemoAfterSec && DemoFlag == false)
    {
      dbgprint("In loop 1:  %d", millis() - LastDoNothingTime);
      DemoFlag = true;
      // first store current mode so we can go back to it after wake up
      DemoModeMem = buttonPushCounter;
      AutoModeMem = autoChangePatterns;
      autoChangePatterns = false;
      buttonPushCounter = 12;
#ifdef HUB75
      dma_display->clearScreen();
#endif
      dbgprint("Automode is turned of because of demo");
    }
    // Wait,signal is back? then wakeup!
    else if (DemoFlag == true && (millis() - LastDoNothingTime) < DemoAfterSec)
    { //("In loop 2:  %d", millis() - LastDoNothingTime);
      // while in demo the democounter was reset due to signal on one of the bars.
      // So we need to exit demo mode.
#ifdef HUB75
      dma_display->clearScreen();
#endif
      buttonPushCounter = DemoModeMem; // restore settings
      dbgprint("automode setting restored to: %d", AutoModeMem);
      autoChangePatterns = AutoModeMem; // restore settings
      DemoFlag = false;
    }
#if BottomRowAlwaysOn
    if (barHeight == 0)
      barHeight = 1; // make sure there is always one bar that lights up
#endif
    // Now visualize those bar heights
    switch (buttonPushCounter)
    {
    case 0:
#ifdef HUB75
      PeakDirection = down;
      BoxedBars(band, barHeight);
      BluePeak(band);
#endif
#ifdef Ledstrip
      changingBarsLS(band, barHeight);
#endif
      break;

    case 1:
#ifdef HUB75
      PeakDirection = down;
      BoxedBars2(band, barHeight);
      BluePeak(band);
#endif
#ifdef Ledstrip
      TriBarLS(band, barHeight);
      TriPeakLS(band);
#endif
      break;
    case 2:
#ifdef HUB75
      PeakDirection = down;
      BoxedBars3(band, barHeight);
      RedPeak(band);
#endif
#ifdef Ledstrip
      rainbowBarsLS(band, barHeight);
      NormalPeakLS(band, PeakColor1);
#endif
      break;
    case 3:
#ifdef HUB75
      PeakDirection = down;
      RedBars(band, barHeight);
      BluePeak(band);
#endif
#ifdef Ledstrip
      purpleBarsLS(band, barHeight);
      NormalPeakLS(band, PeakColor2);
#endif
      break;
    case 4:
#ifdef HUB75
      PeakDirection = down;
      ColorBars(band, barHeight);
#endif
#ifdef Ledstrip
      SameBarLS(band, barHeight);
      NormalPeakLS(band, PeakColor3);
#endif
      break;
    case 5:
#ifdef HUB75
      PeakDirection = down;
      Twins(band, barHeight);
      WhitePeak(band);
#endif
#ifdef Ledstrip
      SameBar2LS(band, barHeight);
      NormalPeakLS(band, PeakColor3);
#endif
      break;
    case 6:
#ifdef HUB75
      PeakDirection = down;
      Twins2(band, barHeight);
      WhitePeak(band);
#endif
#ifdef Ledstrip
      centerBarsLS(band, barHeight);
#endif
      break;
    case 7:
#ifdef HUB75
      PeakDirection = down;
      TriBars(band, barHeight);
      TriPeak(band);
#endif
#ifdef Ledstrip
      centerBars2LS(band, barHeight);
#endif
      break;
    case 8:
#ifdef HUB75
      PeakDirection = up;
      TriBars(band, barHeight);
      TriPeak(band);
#endif
#ifdef Ledstrip
      centerBars3LS(band, barHeight);
#endif
      break;
    case 9:
#ifdef HUB75
      PeakDirection = down;
      centerBars(band, barHeight);
#endif
#ifdef Ledstrip
      BlackBarLS(band, barHeight);
      outrunPeakLS(band);
#endif
      break;
    case 10:
#ifdef HUB75
      PeakDirection = down;
      centerBars2(band, barHeight);
#endif
#ifdef Ledstrip
      BlackBarLS(band, barHeight);
      NormalPeakLS(band, PeakColor5);
#endif
      break;
    case 11:
#ifdef HUB75
      PeakDirection = down;
      BlackBars(band, barHeight);
      DoublePeak(band);
#endif
#ifdef Ledstrip
      BlackBarLS(band, barHeight);
      TriPeak2LS(band);
#endif
      break;
    case 12:
#ifdef HUB75
      make_fire(); // go to demo mode
#endif
#ifdef Ledstrip
      matrix->fillRect(0, 0, matrix->width(), 1, 0x0000); // delete the VU meter
      make_fire();
#endif
      break;
    }

    // Save oldBarHeights for averaging later
    oldBarHeights[band] = barHeight;
  }
  // for calibration
  // bndcounter[h]+=barHeight;
  if (loopcounter == 256)
  {
    loopcounter = 0;
#if CalibratieLog
    Calibration();
    for (int g = 0; g < numBands; g++)
      bndcounter[g] = 0;
#endif
  }
  loopcounter++;

  if (buttonPushCounter != 12)
    DrawVUMeter(0); // Draw it when not in screensaver mode

#if PrintRAWBins
  Serial.printf("\n");
  // delay(10);
#endif

  // Decay peak
  EVERY_N_MILLISECONDS(Fallingspeed)
  {
    for (byte band = 0; band < numBands; band++)
    {
      if (PeakFlag[band] == 1)
      {
        PeakTimer[band]++;
        if (PeakTimer[band] > Peakdelay)
        {
          PeakTimer[band] = 0;
          PeakFlag[band] = 0;
        }
      }
      else if ((peak[band] > 0) && (PeakDirection == up))
      {
        peak[band] += 1;
        if (peak[band] > (kMatrixHeight + 10))
          peak[band] = 0;
      } // when to far off screen then reset peak height
      else if ((peak[band] > 0) && (PeakDirection == down))
      {
        peak[band] -= 1;
      }
    }
    colorTimer++;
  }

  EVERY_N_MILLISECONDS(10)
  colorTimer++; // Used in some of the patterns

  EVERY_N_SECONDS(secToChangePattern)
  {
    // if (FastLED.getBrightness() == 0) FastLED.setBrightness(BRIGHTNESSMARK);  //Re-enable if lights are "off"
    if (autoChangePatterns)
    {
      buttonPushCounter = (buttonPushCounter + 1) % 12;
#ifdef HUB75
      dma_display->clearScreen();
#endif
    }
  }

#ifdef Ledstrip
  delay(1); // needed to give fastled a minimum recovery time
  FastLED.show();
#endif

} // loop end
